frostfire45/Codewarrior/Lib/hc12c/include/mc9s12p96.h
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCIACR1STR;
    
  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCIBDSTR;
extern volatile SCIBDSTR _SCIBD @(REG_BASE + 0x000000C8UL);
#define SCIBD                           _SCIBD.Word
#define SCIBD_SBR0                      _SCIBD.Bits.SBR0
#define SCIBD_SBR1                      _SCIBD.Bits.SBR1
#define SCIBD_SBR2                      _SCIBD.Bits.SBR2
#define SCIBD_SBR3                      _SCIBD.Bits.SBR3
#define SCIBD_SBR4                      _SCIBD.Bits.SBR4
#define SCIBD_SBR5                      _SCIBD.Bits.SBR5
#define SCIBD_SBR6                      _SCIBD.Bits.SBR6
#define SCIBD_SBR7                      _SCIBD.Bits.SBR7
#define SCIBD_SBR8                      _SCIBD.Bits.SBR8
#define SCIBD_SBR9                      _SCIBD.Bits.SBR9
#define SCIBD_SBR10                     _SCIBD.Bits.SBR10
#define SCIBD_SBR11                     _SCIBD.Bits.SBR11
#define SCIBD_SBR12                     _SCIBD.Bits.SBR12
#define SCIBD_TNP0                      _SCIBD.Bits.TNP0
#define SCIBD_TNP1                      _SCIBD.Bits.TNP1
#define SCIBD_IREN                      _SCIBD.Bits.IREN
#define SCIBD_SBR                       _SCIBD.MergedBits.grpSBR
#define SCIBD_TNP                       _SCIBD.MergedBits.grpTNP

#define SCIBD_SBR0_MASK                 1U
#define SCIBD_SBR1_MASK                 2U
#define SCIBD_SBR2_MASK                 4U
#define SCIBD_SBR3_MASK                 8U
#define SCIBD_SBR4_MASK                 16U
#define SCIBD_SBR5_MASK                 32U
#define SCIBD_SBR6_MASK                 64U
#define SCIBD_SBR7_MASK                 128U
#define SCIBD_SBR8_MASK                 256U
#define SCIBD_SBR9_MASK                 512U
#define SCIBD_SBR10_MASK                1024U
#define SCIBD_SBR11_MASK                2048U
#define SCIBD_SBR12_MASK                4096U
#define SCIBD_TNP0_MASK                 8192U
#define SCIBD_TNP1_MASK                 16384U
#define SCIBD_IREN_MASK                 32768U
#define SCIBD_SBR_MASK                  8191U
#define SCIBD_SBR_BITNUM                0U
#define SCIBD_TNP_MASK                  24576U
#define SCIBD_TNP_BITNUM                13U


/*** SCIACR2 - SCI  Alternative Control Register 2; 0x000000CA ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCIACR2 - SCI  Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCIACR2STR;
    #define SCIACR2                     _SCIACR2.Byte
    #define SCIACR2_BKDFE               _SCIACR2.SameAddr_STR.SCIACR2STR.Bits.BKDFE
    #define SCIACR2_BERRM0              _SCIACR2.SameAddr_STR.SCIACR2STR.Bits.BERRM0
    #define SCIACR2_BERRM1              _SCIACR2.SameAddr_STR.SCIACR2STR.Bits.BERRM1
    #define SCIACR2_BERRM               _SCIACR2.SameAddr_STR.SCIACR2STR.MergedBits.grpBERRM
    
    #define SCIACR2_BKDFE_MASK          1U
    #define SCIACR2_BERRM0_MASK         2U
    #define SCIACR2_BERRM1_MASK         4U
    #define SCIACR2_BERRM_MASK          6U
    #define SCIACR2_BERRM_BITNUM        1U
    
    /*** SCICR1 - SCI  Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCICR1STR;
    #define SCICR1                      _SCIACR2.Byte
    #define SCICR1_PT                   _SCIACR2.SameAddr_STR.SCICR1STR.Bits.PT
    #define SCICR1_PE                   _SCIACR2.SameAddr_STR.SCICR1STR.Bits.PE
    #define SCICR1_ILT                  _SCIACR2.SameAddr_STR.SCICR1STR.Bits.ILT
    #define SCICR1_WAKE                 _SCIACR2.SameAddr_STR.SCICR1STR.Bits.WAKE
    #define SCICR1_M                    _SCIACR2.SameAddr_STR.SCICR1STR.Bits.M
    #define SCICR1_RSRC                 _SCIACR2.SameAddr_STR.SCICR1STR.Bits.RSRC
    #define SCICR1_SCISWAI              _SCIACR2.SameAddr_STR.SCICR1STR.Bits.SCISWAI
    #define SCICR1_LOOPS                _SCIACR2.SameAddr_STR.SCICR1STR.Bits.LOOPS
    
    #define SCICR1_PT_MASK              1U
    #define SCICR1_PE_MASK              2U
    #define SCICR1_ILT_MASK             4U
    #define SCICR1_WAKE_MASK            8U
    #define SCICR1_M_MASK               16U
    #define SCICR1_RSRC_MASK            32U
    #define SCICR1_SCISWAI_MASK         64U
    #define SCICR1_LOOPS_MASK           128U
    
