frostfire45/Codewarrior/Lib/hc12c/include/mc9s12p96.h
    #define RDR0AD_RDR0AD0_MASK         1U
    #define RDR0AD_RDR0AD1_MASK         2U
    #define RDR0AD_RDR0AD_MASK          3U
    #define RDR0AD_RDR0AD_BITNUM        0U
    

    /*** RDR1AD - Port ADL Reduced Drive Register; 0x00000275 ***/
    union {
      byte Byte;
      struct {
        byte RDR1AD0     :1;                                       /* Port ADL reduced drive bit 0 */
        byte RDR1AD1     :1;                                       /* Port ADL reduced drive bit 1 */
        byte RDR1AD2     :1;                                       /* Port ADL reduced drive bit 2 */
        byte RDR1AD3     :1;                                       /* Port ADL reduced drive bit 3 */
        byte RDR1AD4     :1;                                       /* Port ADL reduced drive bit 4 */
        byte RDR1AD5     :1;                                       /* Port ADL reduced drive bit 5 */
        byte RDR1AD6     :1;                                       /* Port ADL reduced drive bit 6 */
        byte RDR1AD7     :1;                                       /* Port ADL reduced drive bit 7 */
      } Bits;
    } RDR1ADSTR;
    #define RDR1AD                      _RDR01AD.Overlap_STR.RDR1ADSTR.Byte
    #define RDR1AD_RDR1AD0              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD0
    #define RDR1AD_RDR1AD1              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD1
    #define RDR1AD_RDR1AD2              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD2
    #define RDR1AD_RDR1AD3              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD3
    #define RDR1AD_RDR1AD4              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD4
    #define RDR1AD_RDR1AD5              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD5
    #define RDR1AD_RDR1AD6              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD6
    #define RDR1AD_RDR1AD7              _RDR01AD.Overlap_STR.RDR1ADSTR.Bits.RDR1AD7
    
    #define RDR1AD_RDR1AD0_MASK         1U
    #define RDR1AD_RDR1AD1_MASK         2U
    #define RDR1AD_RDR1AD2_MASK         4U
    #define RDR1AD_RDR1AD3_MASK         8U
    #define RDR1AD_RDR1AD4_MASK         16U
    #define RDR1AD_RDR1AD5_MASK         32U
    #define RDR1AD_RDR1AD6_MASK         64U
    #define RDR1AD_RDR1AD7_MASK         128U
    
  } Overlap_STR;

  struct {
    word RDR1AD0     :1;                                       /* Port AD reduced drive bit 0 */
    word RDR1AD1     :1;                                       /* Port AD reduced drive bit 1 */
    word RDR1AD2     :1;                                       /* Port AD reduced drive bit 2 */
    word RDR1AD3     :1;                                       /* Port AD reduced drive bit 3 */
    word RDR1AD4     :1;                                       /* Port AD reduced drive bit 4 */
    word RDR1AD5     :1;                                       /* Port AD reduced drive bit 5 */
    word RDR1AD6     :1;                                       /* Port AD reduced drive bit 6 */
    word RDR1AD7     :1;                                       /* Port AD reduced drive bit 7 */
    word RDR0AD0     :1;                                       /* Port AD reduced drive bit 8 */
    word RDR0AD1     :1;                                       /* Port AD reduced drive bit 9 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpRDR1AD :8;
    word grpRDR0AD :2;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} RDR01ADSTR;
extern volatile RDR01ADSTR _RDR01AD @(REG_BASE + 0x00000274UL);
#define RDR01AD                         _RDR01AD.Word
#define RDR01AD_RDR1AD0                 _RDR01AD.Bits.RDR1AD0
#define RDR01AD_RDR1AD1                 _RDR01AD.Bits.RDR1AD1
#define RDR01AD_RDR1AD2                 _RDR01AD.Bits.RDR1AD2
#define RDR01AD_RDR1AD3                 _RDR01AD.Bits.RDR1AD3
#define RDR01AD_RDR1AD4                 _RDR01AD.Bits.RDR1AD4
#define RDR01AD_RDR1AD5                 _RDR01AD.Bits.RDR1AD5
#define RDR01AD_RDR1AD6                 _RDR01AD.Bits.RDR1AD6
#define RDR01AD_RDR1AD7                 _RDR01AD.Bits.RDR1AD7
#define RDR01AD_RDR0AD0                 _RDR01AD.Bits.RDR0AD0
#define RDR01AD_RDR0AD1                 _RDR01AD.Bits.RDR0AD1
#define RDR01AD_RDR1AD                  _RDR01AD.MergedBits.grpRDR1AD
#define RDR01AD_RDR0AD                  _RDR01AD.MergedBits.grpRDR0AD

#define RDR01AD_RDR1AD0_MASK            1U
#define RDR01AD_RDR1AD1_MASK            2U
#define RDR01AD_RDR1AD2_MASK            4U
#define RDR01AD_RDR1AD3_MASK            8U
#define RDR01AD_RDR1AD4_MASK            16U
#define RDR01AD_RDR1AD5_MASK            32U
#define RDR01AD_RDR1AD6_MASK            64U
#define RDR01AD_RDR1AD7_MASK            128U
#define RDR01AD_RDR0AD0_MASK            256U
#define RDR01AD_RDR0AD1_MASK            512U
#define RDR01AD_RDR1AD_MASK             255U
#define RDR01AD_RDR1AD_BITNUM           0U
#define RDR01AD_RDR0AD_MASK             768U
#define RDR01AD_RDR0AD_BITNUM           8U


/*** PER01AD - Port AD Pull Up Enable Register; 0x00000276 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PER0AD - Port ADH Pull Up Enable Register; 0x00000276 ***/
    union {
      byte Byte;
      struct {
        byte PER0AD0     :1;                                       /* Port ADH pull up enable bit 0 */
        byte PER0AD1     :1;                                       /* Port ADH pull up enable bit 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPER0AD :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PER0ADSTR;
    #define PER0AD                      _PER01AD.Overlap_STR.PER0ADSTR.Byte
    #define PER0AD_PER0AD0              _PER01AD.Overlap_STR.PER0ADSTR.Bits.PER0AD0
    #define PER0AD_PER0AD1              _PER01AD.Overlap_STR.PER0ADSTR.Bits.PER0AD1
    #define PER0AD_PER0AD               _PER01AD.Overlap_STR.PER0ADSTR.MergedBits.grpPER0AD
    
    #define PER0AD_PER0AD0_MASK         1U
    #define PER0AD_PER0AD1_MASK         2U
    #define PER0AD_PER0AD_MASK          3U
    #define PER0AD_PER0AD_BITNUM        0U
    

    /*** PER1AD - Port ADL Pull Up Enable Register; 0x00000277 ***/
    union {
      byte Byte;
      struct {
        byte PER1AD0     :1;                                       /* Port ADL pull up enable bit 0 */
        byte PER1AD1     :1;                                       /* Port ADL pull up enable bit 1 */
        byte PER1AD2     :1;                                       /* Port ADL pull up enable bit 2 */
        byte PER1AD3     :1;                                       /* Port ADL pull up enable bit 3 */
        byte PER1AD4     :1;                                       /* Port ADL pull up enable bit 4 */
        byte PER1AD5     :1;                                       /* Port ADL pull up enable bit 5 */
        byte PER1AD6     :1;                                       /* Port ADL pull up enable bit 6 */
        byte PER1AD7     :1;                                       /* Port ADL pull up enable bit 7 */
      } Bits;
    } PER1ADSTR;
    #define PER1AD                      _PER01AD.Overlap_STR.PER1ADSTR.Byte
    #define PER1AD_PER1AD0              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD0
    #define PER1AD_PER1AD1              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD1
    #define PER1AD_PER1AD2              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD2
    #define PER1AD_PER1AD3              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD3
    #define PER1AD_PER1AD4              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD4
    #define PER1AD_PER1AD5              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD5
    #define PER1AD_PER1AD6              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD6
    #define PER1AD_PER1AD7              _PER01AD.Overlap_STR.PER1ADSTR.Bits.PER1AD7
    
    #define PER1AD_PER1AD0_MASK         1U
    #define PER1AD_PER1AD1_MASK         2U
    #define PER1AD_PER1AD2_MASK         4U
    #define PER1AD_PER1AD3_MASK         8U
    #define PER1AD_PER1AD4_MASK         16U
    #define PER1AD_PER1AD5_MASK         32U
    #define PER1AD_PER1AD6_MASK         64U
    #define PER1AD_PER1AD7_MASK         128U
    
  } Overlap_STR;

